# HookAngle1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendData..::..HookAngle1 Property
RebarBendData Class See Also
---
The angle of the hook at the end.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int HookAngle1 { get; set; }
```

Visual Basic
---
```text
Public Property HookAngle1 As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int HookAngle1 {
	int get ();
	void set (int value);
}
```

# See Also
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace